app/controllers/bikes_controller.rb

SELECT "bikes".* FROM "bikes"
SELECT COUNT(*) FROM "bikes"
---
  def index
    if Bike.all.empty? then